In [3]:
b = open('data.csv','x')
b.close()

FileExistsError: [Errno 17] File exists: 'data.csv'

In [2]:
import pandas as pd
df = pd.read_csv('data.csv')
df

   Sn   Name  Age    Address       Phone
0   1  Shyam   78  Kathmandu  9856554543
1   2   Hari   23      Patan  9856554543
2   3   Sita   34  Bhaktapur  9856556543
3   4   Nita   56       Bara  9856556543
4   5  Sabin   45       Bara   986744543
5   6  Sabin   34      Patan     9855654

In [3]:
import pandas as pd
df = pd.read_csv('data.csv',nrows = 3)
df

   Sn   Name  Age    Address       Phone
0   1  Shyam   78  Kathmandu  9856554543
1   2   Hari   23      Patan  9856554543
2   3   Sita   34  Bhaktapur  9856556543

In [4]:
import pandas as pd
df = pd.read_csv('data.csv')
df.head()

   Sn   Name  Age    Address       Phone
0   1  Shyam   78  Kathmandu  9856554543
1   2   Hari   23      Patan  9856554543
2   3   Sita   34  Bhaktapur  9856556543
3   4   Nita   56       Bara  9856556543
4   5  Sabin   45       Bara   986744543

In [6]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
df.head(3)

     Name  Age    Address       Phone
Sn
1   Shyam   78  Kathmandu  9856554543
2    Hari   23      Patan  9856554543
3    Sita   34  Bhaktapur  9856556543

In [8]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
df.tail(3)

     Name  Age Address       Phone
Sn
4    Nita   56    Bara  9856556543
5   Sabin   45    Bara   986744543
6   Sabin   34   Patan     9855654

In [10]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn',usecols = ['Sn','Name','Age','Address'])
df

     Name  Age    Address
Sn
1   Shyam   78  Kathmandu
2    Hari   23      Patan
3    Sita   34  Bhaktapur
4    Nita   56       Bara
5   Sabin   45       Bara
6   Sabin   34      Patan

In [17]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
df[0:3]

     Name  Age    Address       Phone
Sn
1   Shyam   78  Kathmandu  9856554543
2    Hari   23      Patan  9856554543
3    Sita   34  Bhaktapur  9856556543

In [32]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
df.iloc[0:3,0:3]

     Name  Age    Address
Sn
1   Shyam   78  Kathmandu
2    Hari   23      Patan
3    Sita   34  Bhaktapur

In [20]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
df.loc[4:5]

     Name  Age Address       Phone
Sn
4    Nita   56    Bara  9856556543
5   Sabin   45    Bara   986744543

In [24]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Name')
df.loc["Hari":"Sabin"]

       Sn  Age    Address       Phone
Name
Hari    2   23      Patan  9856554543
Sita    3   34  Bhaktapur  9856556543
Nita    4   56       Bara  9856556543
Sabin   5   45       Bara   986744543
Sabin   6   34      Patan     9855654

In [28]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
df['Address']

Sn
1    Kathmandu
2        Patan
3    Bhaktapur
4         Bara
5         Bara
6        Patan
Name: Address, dtype: object

In [2]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
df[df['Address'] == 'Bara']

ValueError: Index Sn invalid

In [33]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
data = df[df['Age'] > 50]
data

     Name  Age    Address       Phone
Sn
1   Shyam   78  Kathmandu  9856554543
4    Nita   56       Bara  9856556543

In [36]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
data = df[(df['Age'] > 50) | (df['Address'] == 'Bara')]
data

     Name  Age    Address       Phone
Sn
1   Shyam   78  Kathmandu  9856554543
4    Nita   56       Bara  9856556543
5   Sabin   45       Bara   986744543

In [34]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
data = df[df['Age'] > 50]
data.to_csv('age.csv')

In [9]:
import pandas as pd
data = {'Name':["Aayush","Ram","Sita"],
       'Age':[23,43,32],
       'Address':["Kathmandu","Bhaktapur","Lalitpur"]}

data['Name'].append("Shyam")
data['Age'].append(34)
data['Address'].append('Kalimati')
print(data)
df = pd.DataFrame(data)
df.to_json('newdata.json')

{'Name': ['Aayush', 'Ram', 'Sita', 'Shyam'], 'Age': [23, 43, 32, 34], 'Address': ['Kathmandu', 'Bhaktapur', 'Lalitpur', 'Kalimati']}

In [7]:
df

     Name  Age    Address
0  Aayush   23  Kathmandu
1     Ram   43  Bhaktapur
2    Sita   32   Lalitpur
3   Shyam   34   Kalimati

In [ ]:
import csv
fields=['Kamal','28','Baluwatar']
with open('newdata.csv', 'a') as f:
    x = csv.writer(f)
    x.writerow(fields)

In [13]:
import csv
fields=['Ram','28','Patan']
f = open('newdata.csv', 'a')
x = csv.writer(f)
x.writerow(fields)
f.close()

In [15]:
import csv
fields=[['Ram','28','Patan'],
        ['Shyam','23',"Koteswor"],
       ['Nabin','23','Bhaktapur']]
        
f = open('newdata.csv', 'w')
x = csv.writer(f)
for i in fields:
    x.writerow(i)
f.close()

In [19]:
import csv
data = []
with open('newdata.csv') as csvfile:
    reader = csv.DictReader(csvfile)
    for row in reader:
        data.append(dict(row))
data

[{'Name': 'Ram', 'Age': '28', 'Address': 'Patan'},
 {'Name': 'Shyam', 'Age': '23', 'Address': 'Koteswor'}]

In [22]:
import csv
with open('newdata.csv') as csvfile:
    reader = csv.DictReader(csvfile)
    for row in reader:
        print(dict(row))

{'Name': 'Ram', 'Age': '28', 'Address': 'Patan'}
{'Name': 'Shyam', 'Age': '23', 'Address': 'Koteswor'}

In [24]:
import csv
csv_columns = ['Name', 'Age', 'Address']
dict = [
    {'Name':'Aayush','Age':23,'Address':'Katmandu'},
    {'Name':'Shyam','Age':33,'Address':'Patan'}
]

csvfile = open("data.csv", 'w')
writer = csv.DictWriter(csvfile, fieldnames=csv_columns)

writer.writeheader()

for data in dict:
    writer.writerow(data)
csvfile.close()

In [1]:
import pandas as pd
df = pd.read_csv('data.csv')
df

     Name  Age   Address
0  Aayush   23  Katmandu
1   Shyam   33     Patan